app/views/quests/listing.html.erb

SELECT `quests`.* FROM `quests`
---
    <tbody>
      <% current_user.quests_accepted.each do |quest| %>