app/views/quests/show.html.erb

    <table>
      <% if @quest.pendings.present? %>
---
SELECT `pendings`.* FROM `pendings` WHERE `pendings`.`quest_id` = 1