app/controllers/pendings_controller.rb

  def index
    @pendings = Pending.all
---
SELECT `pendings`.* FROM `pendings`

  def create
    @pending = Pending.new(pending_params)

    respond_to do |format|
      if @pending.save
---
INSERT INTO `pendings` (`quest_id`, `user_id`) VALUES (2, 2)

  def destroy
    @pending.destroy
---
DELETE FROM `pendings` WHERE `pendings`.`id` = 1

    def set_pending
      @pending = Pending.find(params[:id])
---
SELECT  `pendings`.* FROM `pendings` WHERE `pendings`.`id` = 1 LIMIT 1